IlleniumDillon/MM32F5277/PinMap/MM32_QSPI_PinMap.c
#include "MM32_QSPI_PinMap.h"

MM32_QSPI_Pin QSPI_DA3_PA1  = {.periBase = 0, .port = GPIOA, .pin = P01, .af = AF10};
MM32_QSPI_Pin QSPI_DA2_PA2  = {.periBase = 0, .port = GPIOA, .pin = P02, .af = AF10};
MM32_QSPI_Pin QSPI_DA1_PA3  = {.periBase = 0, .port = GPIOA, .pin = P03, .af = AF10};
MM32_QSPI_Pin QSPI_DA0_PA4  = {.periBase = 0, .port = GPIOA, .pin = P04, .af = AF10};
MM32_QSPI_Pin QSPI_SCK_PA5  = {.periBase = 0, .port = GPIOA, .pin = P05, .af = AF10};
MM32_QSPI_Pin QSPI_NSS_PA6  = {.periBase = 0, .port = GPIOA, .pin = P06, .af = AF10};

MM32_QSPI_Pin QSPI_SCK_PB2  = {.periBase = 0, .port = GPIOB, .pin = P02, .af = AF10};
MM32_QSPI_Pin QSPI_DA2_PB3  = {.periBase = 0, .port = GPIOB, .pin = P03, .af = AF10};
MM32_QSPI_Pin QSPI_DA3_PB4  = {.periBase = 0, .port = GPIOB, .pin = P04, .af = AF10};
MM32_QSPI_Pin QSPI_SCK_PB5  = {.periBase = 0, .port = GPIOB, .pin = P05, .af = AF10};
MM32_QSPI_Pin QSPI_NSS_PB6  = {.periBase = 0, .port = GPIOB, .pin = P06, .af = AF10};
MM32_QSPI_Pin QSPI_DA0_PB7  = {.periBase = 0, .port = GPIOB, .pin = P07, .af = AF10};
MM32_QSPI_Pin QSPI_DA1_PB8  = {.periBase = 0, .port = GPIOB, .pin = P08, .af = AF10};
MM32_QSPI_Pin QSPI_NSS_PB10 = {.periBase = 0, .port = GPIOB, .pin = P10, .af = AF10};

MM32_QSPI_Pin QSPI_SCK_PC10 = {.periBase = 0, .port = GPIOC, .pin = P10, .af = AF10};
MM32_QSPI_Pin QSPI_NSS_PC11 = {.periBase = 0, .port = GPIOC, .pin = P11, .af = AF10};

MM32_QSPI_Pin QSPI_DA2_PD10 = {.periBase = 0, .port = GPIOD, .pin = P10, .af = AF10};
MM32_QSPI_Pin QSPI_DA0_PD11 = {.periBase = 0, .port = GPIOD, .pin = P11, .af = AF10};
MM32_QSPI_Pin QSPI_DA1_PD12 = {.periBase = 0, .port = GPIOD, .pin = P12, .af = AF10};
MM32_QSPI_Pin QSPI_DA3_PD13 = {.periBase = 0, .port = GPIOD, .pin = P13, .af = AF10};

MM32_QSPI_Pin QSPI_NSS_PE11 = {.periBase = 0, .port = GPIOE, .pin = P11, .af = AF10};
MM32_QSPI_Pin QSPI_SCK_PE12 = {.periBase = 0, .port = GPIOE, .pin = P12, .af = AF10};

MM32_QSPI_Pin QSPI_SCK_PF5  = {.periBase = 0, .port = GPIOF, .pin = P05, .af = AF10};
MM32_QSPI_Pin QSPI_NSS_PF6  = {.periBase = 0, .port = GPIOF, .pin = P06, .af = AF10};
MM32_QSPI_Pin QSPI_DA0_PF7  = {.periBase = 0, .port = GPIOF, .pin = P07, .af = AF10};
MM32_QSPI_Pin QSPI_DA1_PF8  = {.periBase = 0, .port = GPIOF, .pin = P08, .af = AF10};
MM32_QSPI_Pin QSPI_DA3_PF9  = {.periBase = 0, .port = GPIOF, .pin = P09, .af = AF10};
MM32_QSPI_Pin QSPI_DA2_PF10 = {.periBase = 0, .port = GPIOF, .pin = P10, .af = AF10};

MM32_QSPI_Pin QSPI_DA0_PG6  = {.periBase = 0, .port = GPIOG, .pin = P06, .af = AF10};
MM32_QSPI_Pin QSPI_SCK_PG7  = {.periBase = 0, .port = GPIOG, .pin = P07, .af = AF10};
MM32_QSPI_Pin QSPI_DA3_PG8  = {.periBase = 0, .port = GPIOG, .pin = P08, .af = AF10};
